Revit 2027 API
Category.GetCategory Method
Overload List
Name | Description
GetCategory(Document, BuiltInCategory) | Retrieves a category object corresponding to a BuiltInCategory id.
GetCategory(Document, ElementId) |  Retrieves a category object corresponding to the category id.
Top
See Also
Reference
Category Class
Autodesk.Revit.DB Namespace